{
    "welcome": "Inici",
    "ant": "Anterior",
    "sig": "Següent",
    "mod3d": "MODEL 3D",
    "juegUnity": "JOC UNITY",
    "contactar": "CONTACTAR",
    "esp": "Castellà",
    "cat": "Català",
    "ing": "Anglès",
    "assistant": "Assistent d'en Jordi",
    "selectLanguage": "Selecciona el teu idioma",
    "Project1": "### Visualització de Models 3D\n\nAmb Three.js, puc renderitzar models complexos amb precisió fotogràfica en una escena 3D. Això significa que podem gaudir de models detallats i realistes sense necessitat d'instal·lar programari addicional.\n\n### Controls Interactius\n\nHe integrat OrbitControls per proporcionar una navegació suau i natural.\n\n- **Rotació**: Utilitzeu el botó esquerre del ratolí per girar el model i explorar-lo des de diferents angles.\n- **Zoom**: Ajusteu el zoom amb la roda del ratolí per observar detalls específics de prop o per tenir una vista general del model complet.\n- **Panoràmica**: Moveu la càmera horitzontalment i verticalment mantenint pressionat el botó dret del ratolí per obtenir la perspectiva perfecta.\n\n### Adaptabilitat i Responsivitat\n\nEl disseny del projecte està optimitzat per adaptar-se perfectament a diferents mides de pantalla. Això garanteix que l'experiència de visualització sigui igualment excel·lent tant en dispositius mòbils com en ordinadors d'escriptori, sense comprometre la qualitat ni la funcionalitat.",
    "Project2": "### Comexi, Riudellots de la Selva  -  2023/2024 \n#### Manteniment i Millora d'Aplicacions\n- **Hub utilitzat per més de 500 treballadors diàriament:** Responsable del manteniment i millora contínua d'un conjunt d'aplicacions crítiques.\n- **Aplicacions Laravel:**  Manteniment d'aplicacions fetes amb aquesta tecnologia.\n- **Refactorització:**  Refactorització del codi de les seves aplicacions i millora en la usabilitat.\n\n#### Desenvolupament d'Aplicacions\n- **Desenvolupament de noves aplicacions:** Creació i desenvolupament d'aplicacions utilitzant Laravel i Vue3 per garantir interfícies modernes i eficients.\n- **Desenvolupament d'APIs:** Implementació d'APIs robustes i escalables amb Python i Flask, permetent la integració amb múltiples serveis i aplicacions.\n- **Creació de serveis amb C#:** Desenvolupament de serveis backend utilitzant C# per a operacions d'alt rendiment.\n- **Aplicacions WPF:** Disseny i desenvolupament d'aplicacions Windows Presentation Foundation (WPF) amb C# per a solucions d'escriptori riques en funcionalitats.\n- **Desenvolupament de Chatbot amb IA:** Implementació de xatbots intel·ligents utilitzant tecnologies d'intel·ligència artificial de Gemini i GPT per millorar l'experiència de l'usuari.\n- **Aplicacions sense codi:** Utilització d'AppSheet de Google per crear aplicacions sense necessitat de programació, facilitant solucions ràpides i personalitzades per a diferents departaments.\n\n#### Aplicacions amb Integracions 3D\n- **Desenvolupament d'Aplicacions 3D:** Creació d'aplicacions amb integracions 3D per oferir experiències interactives i visuals avançades.\n\n#### Aplicació WordPress\n- **Desenvolupament d'Aplicació WordPress:** Implementació i personalització de llocs web utilitzant WordPress, aprofitant les seves capacitats de gestió de contingut i flexibilitat.\n\n#### Documentació\n- **Mkdocs:** Realització de la documentació amb aquesta tecnologia i llenguatge markdown.\n- **Drive:** Millora i actualització de documentació interna en Drive.",
    "Project3": "# Programació Independent - 2023\n\n### Desenvolupament d'Aplicacions i Llocs Web per a Clients\n**Desenvolupament Web**\n- **React i Laravel:** Creació de llocs web dinàmics i altament funcionals utilitzant React per al frontend i Laravel per al backend. Projectes personalitzats que compleixen amb els requisits específics de cada client.\n\n**Col·laboració amb Clients**\n- **Treball amb Clients Diversos:** Col·laboració directa amb clients per entendre les seves necessitats i oferir solucions tecnològiques efectives.\n- **Gestió de Projectes:** Gestió integral de projectes des de la concepció fins al lliurament final, assegurant la qualitat i el compliment dels terminis.\n\n**Tecnologies i Eines Utilitzades**\n- **Frontend:** React, JavaScript, HTML, CSS.\n- **Backend:** Laravel, PHP, MySQL.",
    "Project4": "### Projecte Personal: Creació de Servidors de Videojocs i Botiga Online amb Tebex - 2023\n\n#### Descripció\nAquest projecte personal va consistir en la configuració i administració de servidors de videojocs, així com el desenvolupament d'una botiga online utilitzant Tebex per a la monetització i gestió de vendes de productes relacionats amb els jocs.\n\n#### Servidors de Videojocs\n- **Configuració de Servidors:** Implementació i administració de servidors de videojocs per oferir entorns de joc estables i segurs.\n- **Jocs Suportats:** Incloïen jocs populars com Minecraft, ARK: Survival Evolved, i altres.\n\n#### Botiga Online amb Tebex\n- **Desenvolupament de Botiga Online:** Creació i configuració d'una botiga online utilitzant Tebex per a la venda d'articles virtuals, subscripcions i altres productes relacionats amb els servidors de videojocs.\n- **Integració i Personalització:** Integració completa de Tebex a la plataforma web, assegurant una experiència d'usuari fluida i segura.\n- **Gestió de Pagaments i Comandes:** Implementació de mètodes de pagament segurs i automatització del procés de comandes i lliuraments.\n\n## Tecnologies Utilitzades\n- **Servidors de Jocs:** Configuració i administració de servidors basats en Linux.\n- **Tebex:** Plataforma per a comerç electrònic especialitzada en la venda de productes virtuals per a jocs.\n- **HTML/CSS:** Desenvolupament frontend per a la personalització de la botiga online.\n\n## Fites i Resultats\n- **Creixement de la Comunitat:** Atracció de jugadors i clients mitjançant l'oferta de serveis estables i productes atractius a la botiga online.\n- **Generació d'Ingressos:** Monetització exitosa a través de la venda de productes virtuals, subscripcions i serveis addicionals.\n- **Feedback Positiu dels Usuaris:** Rebut comentaris positius sobre la facilitat d'ús de la botiga online i l'estabilitat dels servidors de jocs.\n\n## Conclusions\nAquest projecte no només va demostrar les meves habilitats tècniques en la configuració de servidors i desenvolupament web, sinó també la meva capacitat per gestionar i monetitzar comunitats de jugadors en línia. Vaig aprendre a treballar amb plataformes especialitzades com Tebex i a adaptar-les a les necessitats específiques dels usuaris i jugadors.",
    "GameProject": "## Projecte de Joc\n\n## Explicació del Joc\n\n### Descripció General\nHola! Vull mostrar-te un projecte en el qual he estat treballant. He integrat un joc de Unity en una aplicació web utilitzant react-unity-webgl. És una manera fantàstica de demostrar les meves habilitats tant en Unity com en desenvolupament web. A continuació, t'explico de què tracta el joc i com jugar-lo. Està basat en el Unity Learn 3D Game Kit.\n\n### Objectiu del Joc\nL'objectiu principal del joc és explorar un món ple d'aventures, resoldre puzles i derrotar enemics a mesura que avances per diferents nivells.\n\n### Controls i Mecàniques del Joc\n- **Moviment**: Usa les tecles de fletxa o W, A, S, D per moure el teu personatge.\n- **Saltar**: Prem la barra espaiadora per fer que el teu personatge salti.\n- **Atacar**: Prem el botó esquerre del ratolí per atacar els enemics.\n- **Interactuar**: Prem la tecla E per interactuar amb objectes o NPCs.\n- **Correr**: Mantén premuda la tecla Shift per córrer.\n- **Canviar d'Arma**: Usa la tecla Q per canviar entre les armes disponibles.\n\n### Instruccions Addicionals o Consells\n- **Exploració**: Dedica temps a explorar cada nivell. Hi ha molts secrets i objectes ocults que poden ser molt útils.\n- **Puzles**: Alguns nivells tenen puzles que has de resoldre per avançar. Observa bé el teu entorn i utilitza els objectes disponibles de manera creativa.\n- **Salut i Energia**: Mantén un ull a les teves barres de salut i energia. La salut disminueix al rebre danys i l'energia es fa servir per a accions especials.\n- **Punts de Control**: El joc té punts de control. Si perds tota la teva salut, reapareixeràs a l'últim punt de control que has assolit.\n- **Potenciadors**: Busca potenciadors que poden millorar les teves habilitats, com major velocitat o invencibilitat temporal.\n- **Enemics**: Cada tipus d'enemic té una estratègia diferent per derrotar-lo. Observa els seus patrons i adapta la teva estratègia en conseqüència.\n\n### Detalls de la Integració\nAquest joc de Unity, basat en el 3D Game Kit de Unity Learn, està perfectament integrat en una aplicació React gràcies a la biblioteca react-unity-webgl. Això permet que el joc s'executi sense problemes directament en el navegador, oferint una experiència fluida i receptiva. És una excel·lent demostració de com es poden combinar Unity i tecnologies web modernes.\n\n### Com Jugar\nPer jugar, simplement obre l'aplicació web i espera que es carregui la compilació de Unity WebGL. Un cop estigui carregat, pots començar a jugar seguint les instruccions anteriors.\n\nEspero que gaudeixis jugant tant com jo vaig gaudir desenvolupant-lo!",
    "titleEsfuerzo": "Esforç, treball en equip i millora contínua",
    "descEsfuerzo": "Al llarg dels meus estudis i experiència laboral, he tingut l'oportunitat d'aprendre i dominar diverses tecnologies. Això m'ha permès desenvolupar solucions efectives en múltiples plataformes i projectes. Aquestes són algunes de les tecnologies que he après al llarg de la meva carrera.",
    "titleMejora": "Millora",
    "descMejora": "M'esforço cada dia per millorar en diversos aspectes de la meva feina en programació. El meu enfocament principal és l'eficiència.",
    "titleFamilia": "Família",
    "descFamilia": "Gaudeixo molt passant temps amb la meva família, la qual cosa m'ha ensenyat la importància del treball en equip i la col·laboració.",
    "titleDeportes": "Esports",
    "descDeportes": "Com algú que estima els esports a l'aire lliure, entenc la importància del sacrifici i l'esforç per aconseguir un objectiu.",
    "sobremi": "Sobre mi",
    "expLab": "Experiència Laboral",
    "titCFGS": "CFGS Desenvolupament Aplicacions Web",
    "descCFGS": "Cicle Formatiu de Grau Superior. Desenvolupar, implantar, documentar i mantenir aplicacions multiplataforma, independentment del model utilitzat, utilitzant tecnologies i entorns de desenvolupament específics, garantint l'accés a les dades de forma segura, complint amb els criteris d'accessibilitat, usabilitat i qualitat exigits en els estàndards establerts. Institut Movilivi, Girona 2022 - 2024",
    "titBoot": "Bootcamp Laravel / PHP & MYSQL (215 hores)",
    "descBoot": "Projecte Enfoca't de Fundació Esplai 'ICT Youth Employment', finançat pel Fons Social Europeu a través del 'Ministeri de treball, migracions i seguretat social' i vinculat a la cambra de comerç de Girona.",
    "desarrollador": "Desenvolupador",
    "webJunior": "Web Júnior"
}
