{
    "welcome": "Welcome",
    "ant": "Previous",
    "sig": "Next",
    "mod3d": "3D MODEL",
    "juegUnity": "UNITY GAME",
    "contactar": "CONTACT",
    "esp": "Spanish",
    "cat": "Catalan",
    "ing": "English",
    "assistant": "Jordi's Assistant",
    "selectLanguage": "Select your language",
    "Project1": "### Visualization of 3D Models\n\nWith Three.js, I can render complex models with photographic accuracy in a 3D scene. This means we can enjoy detailed and realistic models without needing to install additional software.\n\n### Interactive Controls\n\nI have integrated OrbitControls to provide smooth and natural navigation.\n\n- **Rotation**: Use the left mouse button to rotate the model and explore it from different angles.\n- **Zoom**: Adjust the zoom with the mouse wheel to observe specific details up close or to get an overview of the entire model.\n- **Pan**: Move the camera horizontally and vertically by holding down the right mouse button to get the perfect perspective.\n\n### Adaptability and Responsiveness\n\nThe project design is optimized to adapt perfectly to different screen sizes. This ensures that the viewing experience is equally excellent on both mobile devices and desktop computers, without compromising quality or functionality.",
    "Project2": "### Comexi, Riudellots de la Selva - 2023/2024 \n#### Maintenance and Improvement of Applications\n- **Hub used by more than 500 workers daily:** Responsible for the maintenance and continuous improvement of a set of critical applications.\n- **Laravel Applications:** Maintenance of applications made with this technology.\n- **Refactoring:** Refactoring the code of their applications and improving usability.\n\n#### Application Development\n- **Development of new applications:** Creation and development of applications using Laravel and Vue3 to ensure modern and efficient interfaces.\n- **API Development:** Implementation of robust and scalable APIs with Python and Flask, allowing integration with multiple services and applications.\n- **Service Creation with C#:** Development of backend services using C# for high-performance operations.\n- **WPF Applications:** Design and development of Windows Presentation Foundation (WPF) applications with C# for feature-rich desktop solutions.\n- **AI Chatbot Development:** Implementation of intelligent chatbots using Gemini and GPT artificial intelligence technologies to enhance the user experience.\n- **No-Code Applications:** Use of Google AppSheet to create applications without programming, enabling quick and personalized solutions for different departments.\n\n#### Applications with 3D Integrations\n- **3D Application Development:** Creation of applications with 3D integrations to offer advanced interactive and visual experiences.\n\n#### WordPress Application\n- **WordPress Application Development:** Implementation and customization of websites using WordPress, leveraging its content management capabilities and flexibility.\n\n#### Documentation\n- **Mkdocs:** Documentation created with this technology and markdown language.\n- **Drive:** Improvement and updating of internal documentation in Drive.",
    "Project3": "# Independent Programming - 2023\n\n### Development of Applications and Websites for Clients\n**Web Development**\n- **React and Laravel:** Creation of dynamic and highly functional websites using React for the frontend and Laravel for the backend. Custom projects that meet the specific requirements of each client.\n\n**Client Collaboration**\n- **Work with Diverse Clients:** Direct collaboration with clients to understand their needs and provide effective technological solutions.\n- **Project Management:** Comprehensive management of projects from conception to final delivery, ensuring quality and meeting deadlines.\n\n**Technologies and Tools Used**\n- **Frontend:** React, JavaScript, HTML, CSS.\n- **Backend:** Laravel, PHP, MySQL.",
    "Project4": "### Personal Project: Creation of Game Servers and Online Store with Tebex - 2023\n\n#### Description\nThis personal project involved the setup and administration of game servers, as well as the development of an online store using Tebex for the monetization and management of sales of game-related products.\n\n#### Game Servers\n- **Server Configuration:** Implementation and administration of game servers to offer stable and secure gaming environments.\n- **Supported Games:** Included popular games like Minecraft, ARK: Survival Evolved, and others.\n\n#### Online Store with Tebex\n- **Online Store Development:** Creation and setup of an online store using Tebex for the sale of virtual items, subscriptions, and other products related to the game servers.\n- **Integration and Customization:** Full integration of Tebex into the web platform, ensuring a smooth and secure user experience.\n- **Payment and Order Management:** Implementation of secure payment methods and automation of the order and delivery process.\n\n## Technologies Used\n- **Game Servers:** Configuration and administration of Linux-based servers.\n- **Tebex:** E-commerce platform specializing in the sale of virtual products for games.\n- **HTML/CSS:** Frontend development for the customization of the online store.\n\n## Achievements and Results\n- **Community Growth:** Attracted players and customers by offering stable services and attractive products in the online store.\n- **Revenue Generation:** Successful monetization through the sale of virtual products, subscriptions, and additional services.\n- **Positive User Feedback:** Received positive feedback on the ease of use of the online store and the stability of the game servers.\n\n## Conclusions\nThis project not only demonstrated my technical skills in server setup and web development but also my ability to manage and monetize online gaming communities. I learned to work with specialized platforms like Tebex and adapt them to the specific needs of users and players.",
    "GameProject": "## Game Project\n\n## Game Explanation\n\n### General Description\nHello! I want to show you a project I have been working on. I have integrated a Unity game into a web application using `react-unity-webgl`. It's a fantastic way to demonstrate my skills in both Unity and web development. Below, I tell you what the game is about and how to play it. It is based on the Unity Learn 3D Game Kit.\n\n### Game Objective\nThe main objective of the game is to explore a world full of adventures, solve puzzles, and defeat enemies as you progress through different levels.\n\n### Game Controls and Mechanics\n- **Movement**: Use the arrow keys or W, A, S, D to move your character.\n- **Jump**: Press the spacebar to make your character jump.\n- **Attack**: Press the left mouse button to attack enemies.\n- **Interact**: Press the E key to interact with objects or NPCs.\n- **Run**: Hold down the Shift key to run.\n- **Switch Weapon**: Use the Q key to switch between available weapons.\n\n### Additional Instructions or Tips\n- **Exploration**: Take time to explore each level. There are many secrets and hidden items that can be very useful.\n- **Puzzles**: Some levels have puzzles that you must solve to progress. Observe your surroundings and use available objects creatively.\n- **Health and Energy**: Keep an eye on your health and energy bars. Health decreases when you take damage, and energy is used for special actions.\n- **Checkpoints**: The game has checkpoints. If you lose all your health, you will respawn at the last checkpoint you reached.\n- **Power-Ups**: Look for power-ups that can enhance your abilities, such as increased speed or temporary invincibility.\n- **Enemies**: Each type of enemy has a different strategy to defeat. Observe their patterns and adapt your strategy accordingly.\n\n### Integration Details\nThis Unity game, based on the Unity Learn 3D Game Kit, is seamlessly integrated into a React application thanks to the `react-unity-webgl` library. This allows the game to run smoothly directly in the browser, offering a fluid and responsive experience. It is an excellent demonstration of how Unity and modern web technologies can be combined.\n\n### How to Play\nTo play, simply open the web application and wait for the Unity WebGL build to load. Once loaded, you can start playing by following the instructions above.\n\nI hope you enjoy playing as much as I enjoyed developing it!",
    "titleEsfuerzo": "Effort, teamwork, and continuous improvement",
    "descEsfuerzo": "Throughout my studies and work experience, I have had the opportunity to learn and master various technologies. This has allowed me to develop effective solutions across multiple platforms and projects. These are some of the technologies I have learned throughout my career.",
    "titleMejora": "Improvement",
    "descMejora": "I strive every day to improve various aspects of my work in programming. My main focus is on efficiency.",
    "titleFamilia": "Family",
    "descFamilia": "I greatly enjoy spending time with my family, which has taught me the importance of teamwork and collaboration.",
    "titleDeportes": "Sports",
    "descDeportes": "As someone who loves outdoor sports, I understand the importance of sacrifice and effort to achieve a goal.",
    "sobremi": "About Me",
    "expLab": "Work Experience",
    "titCFGS": "CFGS Web Application Development",
    "descCFGS": "Advanced Vocational Training Course. Developing, implementing, documenting, and maintaining multiplatform applications, regardless of the model used, using specific development technologies and environments, ensuring secure data access, meeting accessibility, usability, and quality standards required by established standards. Movilivi Institute, Girona 2022 - 2024",
    "titBoot": "Bootcamp Laravel / PHP & MYSQL (215 hours)",
    "descBoot": "Enfoca't Project by Fundación Esplai 'ICT Youth Employment', funded by the European Social Fund through the 'Ministry of Labor, Migrations and Social Security' and linked to the Girona Chamber of Commerce.Girona. /nSalt, Girona /n2022",
    "desarrollador": "Junior Web",
    "webJunior": "Developer"
}